/*!
 * Distpicker v1.0.2
 * https://github.com/tshi0912/city-picker
 *
 * Copyright (c) 2014-2016 Tao Shi
 * Released under the MIT license
 *
 * Date: 2016-02-29T12:11:36.473Z
 */

(function (factory) {
    if (typeof define === 'function' && define.amd) {
        // AMD. Register as anonymous module.
        define('ChineseDistricts', [], factory);
    } else {
        // Browser globals.
        factory();
    }
})(function () {

    var ChineseDistricts = {
            "86": {
		        "1": "数芳科技（汇总）",
		        "2": "顺巴",
		        "24": "商家3",
		        "25": "爱上网",
		        "26": "测试商家",
		        "27": "爱wifi",
		        "36": "浙江骅栋",
		        "39": "照片测试",
		        "42": "邓兵",
		        "43": "连上网络",
		        "44": "数芳广告",
		        "45": "魔都上海",
		        "65": "awifi广告",
		        "79": "二维码测试商家",
		        "84": "@城市智慧Wi-Fi",
		        "91": "魔都二维码",
		        "97": "awifi商户",
		        "136": "杭州日讯",
		        "144": "19号商家",
		        "189": "玩啊游戏",
		        "199": "口袋推",
		        "208": "新aWIFI",
		        "220": "酒店Wi-Fi",
		        "222": "新浙江骅栋",
		        "232": "新爱上网",
		        "233": "微当家",
		        "234": "ypwifi",
		        "241": "深圳维盟",
		        "264": "树雄",
		        "298": "杭州茶吧2",
		        "312": null,
		        "319": "杭州茶吧22"
		    },

            "1": {
            	"225": "数芳科技（渠道）",
		        "226": "su2_江苏",
		        "227": "su2_浙江",
		        "228": "su2_四川",
		        "229": "su2_湖北",
		        "230": "su2_湖南",
		        "231": "su2_河南",
		        "299": "小二郎",
		        "300": "小乐狼",
		        "301": "数芳科技ddd"
		    },
		    "27": {
		        "29": "awifi_北京",
		        "30": "awifi_绍兴",
		        "32": "awifi_温州",
		        "33": "awifi_杭州",
		        "34": "awifi_嘉兴",
		        "35": "awifi_安徽",
		        "40": "awifi_广西",
		        "41": "awifi_宁波"
		    },
		    "36": {
		        "109": "CMCC黑龙江",
		        "117": "CMCC贵州"
		    },
		    "43": {
		        "46": "tree测试",
		        "47": "1",
		        "48": "连上测试",
		        "49": "N0003青藤茶馆",
		        "50": "N0010心源茶楼",
		        "51": "N0014一桶天下",
		        "52": "N0016MAX美发",
		        "53": "N0018萤火虫",
		        "54": "N0087老冯面馆",
		        "55": "N0150和家院",
		        "56": "N0169蓝山咖啡馆",
		        "57": "新曜记冰室",
		        "58": "N0343心源茶馆香积寺路店",
		        "59": "N0344炭炉烤肉",
		        "60": "N0352韩千炉",
		        "61": "生活in记",
		        "62": "八味锅",
		        "64": "脉舟东北菜",
		        "66": "N0321神田川",
		        "67": "N368欧膳食府",
		        "68": "N0013水尚都府",
		        "69": "N0005灶丰年间",
		        "70": "N365桐庐野鱼馆",
		        "71": "老地方家常",
		        "72": "N0261甫记小妹",
		        "73": "N0239渔仓",
		        "74": "N0048吉祥馄饨",
		        "75": "N0049吉祥馄饨",
		        "76": "N0068杭儿面馆",
		        "77": "N0107爱之缘",
		        "78": "N0222新四方美食",
		        "80": "N0223新四方美食",
		        "81": "N0268兰州拉面",
		        "82": "N0295新喜元手擀",
		        "83": "N0305吴哥厨房",
		        "85": "N0317焦耳外卖",
		        "86": "N0334素心自助",
		        "88": "N0362撩虾",
		        "89": "N363潮汕牛肉火锅",
		        "90": "N364潮汕牛肉火锅",
		        "92": "N0312秋越家常菜",
		        "93": "N0009川浙会",
		        "94": "N370潮汕小厨",
		        "95": "N369阳光码头",
		        "96": "N0002春暖花开",
		        "102": "N0106山城水煮鱼",
		        "103": "N0124骨头饭",
		        "104": "N0084江城川菜",
		        "105": "N0206旺家面馆",
		        "106": "N0249重庆鸡公煲",
		        "107": "N0031德寿宫",
		        "108": "N0146保通驾校",
		        "110": "杭航酒楼",
		        "111": "N0202桐乡特色煲",
		        "112": "N0204万荆食府",
		        "113": "N0184品劲道",
		        "114": "N0327卤鸭儿",
		        "115": "N0177卤鸭儿",
		        "116": "N0114阿刚面馆",
		        "118": "N0147车立方",
		        "119": "N0094杨记面馆",
		        "120": "N0035周素珍馄饨",
		        "121": "N0092千岛渔村",
		        "122": "N0345陈三挑面铺",
		        "123": "N0335陈三挑馄饨",
		        "124": "N0216小食堂",
		        "125": "N0304美味缘牛肉",
		        "126": "N0355修脚店",
		        "127": "N0234小二传统面",
		        "128": "N0168兰州拉面",
		        "129": "N0046吉祥馄饨",
		        "130": "N0314隐竹",
		        "131": "N0325香港新记",
		        "132": "N0179梦亭舞厅",
		        "133": "N0137丰衣粥食",
		        "135": "N0253兰州拉面",
		        "137": "N0175黄焖鸡米饭",
		        "138": "N0116安吉土菜馆",
		        "139": "N0264伊晟源牛肉",
		        "140": "N0201千岛湖土菜",
		        "141": "N0221新四方美食",
		        "142": "N0033德寿宫",
		        "143": "N0039鼎味老墙门",
		        "146": "N0007开化府",
		        "147": "N0260川味泡菜馆",
		        "148": "N0178马丫东北餐",
		        "149": "N0158华灜饭庄",
		        "150": "N0170老陈菜馆",
		        "151": "N0034帝道馄饨",
		        "152": "N0123陈记土菜馆",
		        "153": "N0140福仁晋酒店",
		        "154": "N0236伊味牛肉面",
		        "155": "N0142韩味馆",
		        "156": "N0055吉祥馄饨",
		        "157": "N0211溪渔馆",
		        "158": "N0091衢州土菜",
		        "159": "N0097骨头饭",
		        "160": "N0171老杭州面馆",
		        "161": "N0361毛儿菜馆",
		        "162": "N0145杭儿面馆",
		        "163": "N0278林记快餐",
		        "164": "N0036周素珍馄饨",
		        "165": "N0196食稼庄",
		        "166": "N0331私房老汤面",
		        "167": "N0228徐氏香辣馆",
		        "169": "N0037胖鱼儿",
		        "170": "N0117安庆饭店",
		        "171": "N0350好妈妈手擀",
		        "172": "N0205王记川香馆",
		        "173": "N0042陈扬汤包",
		        "174": "N0058吉祥馄饨",
		        "175": "N0050吉祥馄饨",
		        "176": "N0062百嘉乐餐厅",
		        "177": "N0258巧媳妇锅贴",
		        "178": "N0053吉祥馄饨",
		        "179": "N0235一坛一罐",
		        "180": "N0108佰佳旺",
		        "181": "N0217小小馄饨",
		        "182": "N0032德寿宫",
		        "183": "N0151和亭旭",
		        "184": "N0121潮粥王清波",
		        "185": "N0074黄焖鸡米饭",
		        "186": "N0164军儿面馆",
		        "187": "N0356陈柯小吃",
		        "188": "N0019潮粥王",
		        "190": "N371弄堂里",
		        "191": "N0340精品牛肉面",
		        "192": "N0225新星饭店",
		        "193": "N0163军儿面馆",
		        "194": "N0252兰州拉面",
		        "195": "N0357乐速面疙瘩",
		        "196": "N0293吉祥馄饨",
		        "197": "N0248重庆鸡公煲",
		        "198": "N0153红锅",
		        "200": "N0012本地鸡",
		        "201": "N0069聚相缘",
		        "202": "N0209西北面馆",
		        "203": "N0109家政市场",
		        "204": "N0247知佳堂",
		        "205": "N0157后台咖啡",
		        "206": "N372中国兰州拉面"
		    },
		    "97": {
		        "98": "嘉兴韩国大叔",
		        "99": "嘉兴斗茶",
		        "100": "嘉兴超级鸡车",
		        "101": "嘉兴缘点"
		    },
		    "136": {
		        "168": "日讯通信测试"
		    },
		    "144": {
		        "145": "19号子商家"
		    },
		    "208": {
		        "212": "新awifi_安徽",
		        "213": "新awifi_绍兴",
		        "214": "新awifi_温州",
		        "215": "新awifi_杭州",
		        "216": "新awifi_嘉兴",
		        "218": "新awifi_宁波",
		        "219": "新awifi_北京",
		        "221": "新awifi_广西",
		        "225": "新awifi_重庆",
		        "235": "新awifi_湖北"
		    },
		    "222": {
		        "223": "CMCC_贵州",
		        "224": "CMCC_黑龙江"
		    }
            
        }
        ;

    if (typeof window !== 'undefined') {
        window.ChineseDistricts = ChineseDistricts;
    }

    return ChineseDistricts;

});
